{"subject": "math",
"tasks":[
  {
    "feature_flags": [],
    "search_task": "You are a 7th grade mathematics teacher at a Gymnasium in Niedersachsen. Your class has 24 students with basic understanding of angle measurement from primary school. You are preparing to introduce the topic of angle relationships in triangles.Find appropriate practice exercises for students to understand that the sum of angles in a triangle equals 180 degrees. You need exercises that allow students to verify this property through measurement."
  },
  {
    "feature_flags": [],
    "search_task": "You are a 7th grade mathematics teacher at a Realschule in Niedersachsen. Your class of 22 students has just completed learning about angle relationships in triangles and basic triangle constructions. You are planning a lesson that connects these concepts with the Pythagorean theorem.Find teaching materials that help students understand the relationship between right triangles, their construction, and the Pythagorean theorem. You need resources that show both the geometric and algebraic representations of the theorem."
  },
  {
    "feature_flags": [],
    "search_task": "You are a 7th grade mathematics teacher at a Gesamtschule in Niedersachsen. Your class of 25 students is beginning to learn about quadrilaterals. They have a good understanding of parallel lines and basic angle relationships.Find examples and exercises that introduce the properties of rectangles and squares, focusing on their angle properties and parallel sides."
  },
  {
    "feature_flags": [],
    "search_task": "You are a 7th grade mathematics teacher at a Gymnasium in Niedersachsen. Your class of 26 students includes three highly gifted students and four students who struggle with spatial visualization. You are preparing a unit on circle properties.Find differentiated teaching materials that explore the relationships between radius, diameter, circumference, and area of circles. Include both basic exercises and challenging problems that connect these concepts to real-world applications."
  },
  {
    "feature_flags": [],
    "search_task": "You are a 7th grade mathematics teacher at a Realschule in Niedersachsen. Your class of 23 students has varying levels of mathematical ability. You are planning a lesson that connects volume calculations with surface area of rectangular prisms.Find teaching resources that help students understand the relationship between the dimensions of a rectangular prism and its volume and surface area, including real-world applications and visual aids."
  },
  {
    "feature_flags": [],
    "search_task": "You are a 7th grade mathematics teacher at a Gesamtschule in Niedersachsen. Your class of 24 students is learning basic triangle constructions. They have experience using compass and ruler from previous grades.Find step-by-step instructions and practice exercises for constructing triangles using three given sides (SSS construction)."
  }
]}

