{"subject": "math",
"tasks":[
  {
    "feature_flags": [],
    "search_task": "Find age-appropriate examples of probability misconceptions and common student errors when first learning about chance, specifically focusing on materials suitable for 8th graders who haven't had formal probability instruction.",
  },
  {
    "feature_flags": ["summary", "snippets"],
    "search_task": "Investigate different approaches to teaching the law of large numbers that: <ul> <li>Use digital tools or physical objects</li> <li>Help students visualize the convergence of relative frequencies</li> <li>Account for different student learning speeds</li> <li>Include opportunities for group work</li> <li>Can be completed within 2-3 class periods</li> </ul> ",
    "relevance_dimensions": [
      "What kinds of hands on pedagogical approaches does it offer?", 
      "What kind of non-textual pedagogical approaches does it offer?", 
      "What mathematical concepts does it cover?"]
  },
  {
    "feature_flags": ["summary", "metadata"],
    "search_task": "Locate teaching materials that demonstrate the difference between theoretical and experimental probability using regular geometric solids (cubes, rectangular prisms, etc.) including specific mathematical explanations appropriate for 13-14 year olds.",
  },
  {
    "feature_flags": [],
    "search_task": "Research engaging real-world contexts for teaching probability with asymmetric objects that: <ul> <li>Connect to student interests</li> <li>Allow for meaningful data collection</li> <li>Demonstrate why theoretical probability calculations don't always work</li> <li>Include opportunities for students to make and test predictions</li> <li>Support understanding of probability as a forecast</li> </ul> "
  },
  {
    "feature_flags": ["summary", "snippets"],
    "search_task": "Find ready-to-use worksheets or digital materials showing how to introduce tree diagrams for two-stage probability experiments, including worked examples that progress from simple to complex scenarios.",
    "relevance_dimensions": [
      "Does it include worksheets?", 
      "Does it provide worked out examples?", 
      "What learning goals does it address?"]
  },
  {
    "feature_flags": ["summary", "metadata"],
    "search_task": "Explore assessment approaches that: <ul> <li>Combine theoretical and experimental probability</li> <li>Include both single and multi-stage experiments</li> <li>Allow students to demonstrate understanding in multiple ways</li> <li>Connect to real-world applications</li> <li>Are appropriate for different skill levels in the class</li> <li>Can show student growth across the unit's key concepts</li> </ul> "
  }
]}

