Low Complexity Tasks:

1. "You are teaching a 9th grade mathematics class of 25 students at a Gymnasium in Niedersachsen. Your students have a solid foundation in basic geometry and are familiar with right triangles. Find teaching materials to introduce the Pythagorean theorem using a hands-on approach."
[Single concept, single resource type, standard teaching method]

2. "You are teaching a 9th grade class of 22 students at a Realschule in Niedersachsen. Your students have just learned about right triangles. Find practice problems to help students calculate unknown side lengths in right triangles using the square root operation."
[Single concept, single resource type, standard teaching method]

3. "You are teaching geometry to a 10th grade class of 24 students at a Gymnasium in Niedersachsen. Find visual materials to explain the concept of similar triangles, focusing on angle correspondence."
[Single concept, single resource type, standard teaching method]

4. "You are teaching a 9th grade mathematics class of 23 students at a Gymnasium in Niedersachsen. Find exercises to help students practice calculating tangent values in right triangles as a measure of steepness."
[Single concept, single resource type, standard teaching method]

High Complexity Tasks:

1. "You are teaching a 10th grade class of 26 students at a Gymnasium in Niedersachsen. Students understand basic trigonometry but struggle with applications. Find materials to create a lesson that connects the tangent function to real-world slope calculations and similar triangles, including interactive simulations and practical examples."
[High: multiple concepts, multiple resource types]

2. "You are teaching a 9th grade class of 24 students at a Realschule in Niedersachsen. Find resources to design a comprehensive lesson that connects the Pythagorean theorem with square roots and their properties, including derivations, proofs, and practical applications."
[High: concept hierarchy, multiple teaching strategies]

3. "You are teaching geometry to a 10th grade class of 25 students at a Gymnasium in Niedersachsen. Your students have mastered basic trigonometry. Find materials to create a lesson sequence that bridges from right triangle trigonometry to general triangles using the sine and cosine laws, incorporating both mathematical proofs and practical applications."
[High: multiple concepts, multiple teaching strategies]

4. "You are teaching a 10th grade class of 23 students at a Gymnasium in Niedersachsen. Find resources to develop a lesson that integrates similarity theorems for triangles with trigonometric relationships, including geometric proofs, visual demonstrations, and real-world applications."
[High: multiple concepts, multiple resource types]
