{
  "subject": "physics",
  "tasks": [
  {
  "feature_flags": [],
  "search_task": "Find documentation, safety guidelines, and procedural guides about using multimeters in middle school classrooms. Focus on materials that include clear step-by-step instructions and troubleshooting guides.",
  "relevance_dimensions": [
  "What safety considerations are explicitly addressed?",
  "How are complex concepts broken down into manageable steps?",
  "What assessment methods are included to verify student competency?"
  ]
  },
  {
  "feature_flags": ["summary", "metadata"],
  "search_task": "Find comprehensive written analogies and physical models for teaching electric current flow that avoid common misconceptions. Look for materials that use tangible demonstrations with everyday objects, suitable for 7th/8th grade.",
  "relevance_dimensions": [
  "How effectively does the analogy avoid common electrical misconceptions?",
  "What level of scaffolding is provided to help students transition from the analogy to the actual concept?",
  "How well does the model account for both current and energy flow in circuits?"
  ]
  },
  {
  "feature_flags": ["summary", "snippets"],
  "search_task": "Research technical specifications and documentation of common household devices and their voltage requirements. Look for materials that can be adapted into age-appropriate learning resources for 7th/8th grade.",
  "relevance_dimensions": [
  "How well do the examples connect to students' everyday experiences?",
  "What level of technical detail is appropriate for this age group?",
  "How are safety considerations integrated into the learning materials?"
  ]
  },
  {
  "feature_flags": ["summary", "metadata"],
  "search_task": "Explore different approaches to teaching Ohm's Law through guided discovery. Look for resources that describe inquiry-based learning sequences where students derive the relationship themselves.",
  "relevance_dimensions": [
  "What prerequisite knowledge is required for the discovery activities?",
  "How is mathematical understanding scaffolded throughout the sequence?",
  "What formative assessment opportunities are built into the discovery process?"
  ]
  },
  {
  "feature_flags": [],
  "search_task": "Find documentation about household electrical circuits and power consumption that can be used to create authentic learning tasks. Focus on materials that clearly explain real-world applications.",
  "relevance_dimensions": [
  "How well does the material connect to energy conservation concepts?",
  "What level of mathematical complexity is involved?",
  "How applicable is the content to students' home environments?"
  ]
  },
  {
  "feature_flags": ["summary", "snippets"],
  "search_task": "Research different types of culminating physics projects that integrate multiple electricity concepts. Look for projects that allow for differentiation and real-world connections.",
  "relevance_dimensions": [
  "How well does the project integrate theoretical and practical knowledge?",
  "What opportunities exist for differentiation and student choice?",
  "How are safety considerations addressed in the project guidelines?"
  ]
  }
  ]
  }